# St7SetWindowColours

Sets the background colour(s) of the model window.

Model Window

long St7SetWindowColours(long uID, long WindowMode, long SolidColour,

long GradientColour)

Input Parameters

uID

Strand7 model file ID.

WindowMode

Either wmPreProcessing or wmPostProcessing.

SolidColour

Solid background colour or upper colour for gradient backgrounds.  See also RGB Colours.

GradientColour

Lower colour for gradient backgrounds.  See also RGB Colours.